Tianshang301/TianshangPulse/firmware/sdkconfig.defaults
# ESP-IDF v5.4+ / ESP32-P4 target (set via: idf.py set-target esp32p4)
CONFIG_IDF_TARGET="esp32p4"

# PSRAM: 16MB external, required for TFLite Micro arena
CONFIG_SPIRAM=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_OPTIMIZED_SCHEDULER=y

# BLE (NimBLE host + controller)
CONFIG_BT_ENABLED=y
CONFIG_BT_CONTROLLER_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=512
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1

# I2C bus (shared by MAX30102 + MPU6886)
CONFIG_SENSOR_I2C_PORT=0
CONFIG_SENSOR_SDA_GPIO=18
CONFIG_SENSOR_SCL_GPIO=8
